# การประมวลผลแบบสอบถามด้วย Descriptive Statistics

In [412]:
import numpy as np
import pandas as pd

## อ่านข้อมูลจากไฟล์ CSV

In [413]:
data = pd.read_csv("/Users/phisan/ResearchCode/NoteBook/Stats/Teaching/data/mean.csv")

In [414]:
data.head()

,id,sex,age,level,faculty,y11,y12,y13,y14,y15,y21,y22,y23,y24,y25,y31,y32,y33,y34,y35
0,1,1,1,3,1,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5
1,2,2,4,3,1,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4
2,3,1,1,1,1,4,3,4,3,4,3,4,3,4,3,4,3,4,3,4
3,4,2,2,2,2,5,4,5,4,5,4,5,4,5,4,5,4,5,4,5
4,5,2,3,3,3,3,4,5,3,4,5,5,5,5,5,4,4,4,4,4

In [415]:
data.shape

(30, 20)

## ตรวจสอบ missing data ในแต่ละตัวแปร

In [416]:
data.isnull().any()

id         False
sex        False
age        False
level      False
faculty    False
y11        False
y12        False
y13        False
y14        False
y15        False
y21        False
y22        False
y23        False
y24        False
y25        False
y31        False
y32        False
y33        False
y34        False
y35        False
dtype: bool

## แสดงจำนวนแถวและคอลัมน์

In [417]:
data.shape

(30, 20)

## สรุปข้อมูล Nominal และ Ordinal

### ข้อมูลเกี่ยวกับเพศ

In [418]:
sex_counts = data.groupby('sex').size()
sex_counts

sex
1    10
2    20
dtype: int64

#### คำนวณเปอร์เซ็นต์

In [419]:
tot_sex = sex_counts.sum()
percent = [((i/tot_sex) * 100) for i in sex_counts]
percent

[33.33333333333333, 66.66666666666666]

#### แสดงผลข้อมูลในรูปแบบ Data Frame

In [420]:
sex_df = pd.DataFrame({"1.Label":['ชาย', 'หญิง'], 
                       "2.Sex":sex_counts, 
                       "3.Percent":percent})
sex_df

    1.Label  2.Sex  3.Percent
sex
1       ชาย     10  33.333333
2      หญิง     20  66.666667

### ข้อมูลเกี่ยวกับอายุ

In [421]:
age_counts = data.groupby('age').size()
age_counts

age
1    11
2    10
3     3
4     6
dtype: int64

In [422]:
tot_age = age_counts.sum()
percent = [(i / tot_age) * 100 for i in age_counts]

In [423]:
age_df = pd.DataFrame({"1.Label":['ต่ำกว่าหรือเท่ากับ 18 ปี', '19 ปี', '20 ปี', 'มากกว่า 20 ปี'], 
                       "2.Sex":age_counts,
                       "3.Percent":percent})
age_df

                      1.Label  2.Sex  3.Percent
age
1    ต่ำกว่าหรือเท่ากับ 18 ปี     11  36.666667
2                       19 ปี     10  33.333333
3                       20 ปี      3  10.000000
4               มากกว่า 20 ปี      6  20.000000

### ข้อมูลเกี่ยวกับระดับชั้นปี

In [424]:
level_counts = data.groupby('level').size()
level_counts

level
1    6
2    6
3    8
4    5
5    5
dtype: int64

In [425]:
tot_level = level_counts.sum()
percent = [(i / tot_level) * 100 for i in level_counts]

In [426]:
level_df = pd.DataFrame({"1.Label":["ชั้นปีที่ 1", "ชั้นปีที่ 2", "ชั้นปีที่ 3", "ชั้นปีที่ 4", "ชั้นปีที่ 5"],
                         "2.Level":level_counts,
                         "3.Percent":percent})
level_df

           1.Label  2.Level  3.Percent
level
1      ชั้นปีที่ 1        6  20.000000
2      ชั้นปีที่ 2        6  20.000000
3      ชั้นปีที่ 3        8  26.666667
4      ชั้นปีที่ 4        5  16.666667
5      ชั้นปีที่ 5        5  16.666667

### ข้อมูลเกี่ยวกับคณะ

In [427]:
fac_count = data.groupby('faculty').size()
fac_count

faculty
1    19
2     5
3     4
4     1
5     1
dtype: int64

In [428]:
tot_fac = fac_count.sum()
percent = [(i / tot_fac) * 100 for i in fac_count]
fac_df = pd.DataFrame({"1.Lable":['ครุศาสตร์', 'บริหารธุรกิจและการบัญชี', 'มนุษย์ศาสตร์', 'ศิลปศาสตร์และวิทยาศาสตร์', 'วิทยาลัยกฎหมายและการปกครอง'],
                       "2.Fac":fac_count,
                       "3.Percent":percent})
fac_df

                            1.Lable  2.Fac  3.Percent
faculty
1                         ครุศาสตร์     19  63.333333
2           บริหารธุรกิจและการบัญชี      5  16.666667
3                      มนุษย์ศาสตร์      4  13.333333
4          ศิลปศาสตร์และวิทยาศาสตร์      1   3.333333
5        วิทยาลัยกฎหมายและการปกครอง      1   3.333333

### ทำการลบคอลัมท์ ข้อมูล Nominal , Ordinal ออกจากข้อมูล

In [429]:
df = data.drop(['id', 'sex', 'age', 'level', 'faculty'], axis=1)
df.head()

   y11  y12  y13  y14  y15  y21  y22  y23  y24  y25  y31  y32  y33  y34  y35
0    5    5    5    5    5    5    5    5    5    5    5    5    5    5    5
1    4    4    4    4    4    4    4    4    4    4    4    4    4    4    4
2    4    3    4    3    4    3    4    3    4    3    4    3    4    3    4
3    5    4    5    4    5    4    5    4    5    4    5    4    5    4    5
4    3    4    5    3    4    5    5    5    5    5    4    4    4    4    4

In [430]:
df.shape

(30, 15)

### แบ่งข้อมูลออกเป็นกลุ่มตามตัวแปร

In [431]:
y1 = df.loc[:, 'y11':'y15']
y1.head()

   y11  y12  y13  y14  y15
0    5    5    5    5    5
1    4    4    4    4    4
2    4    3    4    3    4
3    5    4    5    4    5
4    3    4    5    3    4

In [432]:
y2 = df.loc[:, 'y21':'y25']
y2.head()

   y21  y22  y23  y24  y25
0    5    5    5    5    5
1    4    4    4    4    4
2    3    4    3    4    3
3    4    5    4    5    4
4    5    5    5    5    5

In [433]:
y3 = df.loc[:, 'y31':'y35']
y3.head()

   y31  y32  y33  y34  y35
0    5    5    5    5    5
1    4    4    4    4    4
2    4    3    4    3    4
3    5    4    5    4    5
4    4    4    4    4    4

### ทำการหาค่าเฉลี่ย และส่วนเบี่ยงเบนมาตรฐานของตัวแปร y1

In [434]:
y1.mean()

y11    4.166667
y12    4.166667
y13    4.500000
y14    4.000000
y15    4.500000
dtype: float64

In [435]:
y1.std()

y11    0.698932
y12    0.698932
y13    0.508548
y14    0.830455
y15    0.508548
dtype: float64

In [436]:
label = ['1.รสชาติอาหารและเครื่องดื่ม', 
         '2.คุณค่าทางอาหารที่ผู้บริการได้รับ', 
         '3.ความสะอาดของอาหารและเครื่องดื่ม', 
         '4.ความสะอาดของภาชนะบรรจุอาหาร', 
         '5.ความรวดเร็วในการให้บริการ']

y1_result = {"Label":label, "Mean":y1.mean(), "STD":y1.std()}
y1_df = pd.DataFrame(y1_result)

In [437]:
y1_df

                                  Label      Mean       STD
y11         1.รสชาติอาหารและเครื่องดื่ม  4.166667  0.698932
y12  2.คุณค่าทางอาหารที่ผู้บริการได้รับ  4.166667  0.698932
y13   3.ความสะอาดของอาหารและเครื่องดื่ม  4.500000  0.508548
y14       4.ความสะอาดของภาชนะบรรจุอาหาร  4.000000  0.830455
y15         5.ความรวดเร็วในการให้บริการ  4.500000  0.508548

### หาค่าเฉลี่ยและส่วนเบี่ยงเบนมาตรฐานรวมของ y1

In [438]:
y1_tot_mean = y1_df['Mean'].mean()
y1_tot_std = y1.stack().std()

print("Total mean is : {0:.2f}".format(y1_tot_mean))
print("Total std is : {0:.2f}".format(y1_tot_std))

Total mean is : 4.27
Total std is : 0.68

### ทำการหาค่าเฉลี่ย และส่วนเบี่ยงเบนมาตรฐานของตัวแปร y2

In [439]:
label = ['1.แต่งกายสะอาด', 
         '2.ให้บริการด:วยความสุภาพ', 
         '3.มีความกระตือรือร้นตKอการให้บริการ', 
         '4.บริการด้วยความเต็มใจ', 
         '5.มีมนุษย์สัมพันธ์ที่ดีกับผู้รับบริการ']

y2_result = {"Label":label, "Mean":y2.mean(), "STD":y2.std()}
y2_df = pd.DataFrame(y2_result)

In [440]:
y2_df

                                      Label      Mean       STD
y21                          1.แต่งกายสะอาด  4.333333  0.758098
y22                2.ให้บริการด:วยความสุภาพ  4.666667  0.479463
y23     3.มีความกระตือรือร้นตKอการให้บริการ  4.333333  0.758098
y24                  4.บริการด้วยความเต็มใจ  4.500000  0.508548
y25  5.มีมนุษย์สัมพันธ์ที่ดีกับผู้รับบริการ  4.166667  0.698932

In [441]:
y2_tot_mean = y2_df['Mean'].mean()
y2_tot_std = y2.stack().std()

print("Total mean is : {0:.2f}".format(y2_tot_mean))
print("Total std is : {0:.2f}".format(y2_tot_std))

Total mean is : 4.40
Total std is : 0.67

### ทำการหาค่าเฉลี่ย และส่วนเบี่ยงเบนมาตรฐานของตัวแปร y3

In [442]:
label = ['1.ด้านความเหมาะสมของราคาอาหารเมื่อเทียบกับปริมาณอาหาร', 
         '2.ราคาอาหารมีความเหมาะสมเมื่อเทียบกับคุณภาพ', 
         '3.มีป้ายบอกราคาที่เห็นได้ชัดเจน', 
         '4.เครื่องดื่มมีหลายราคา', 
         '5.อาหารมีหลากหลายราคา']

y3_result = {"Label":label, "Mean":y3.mean(), "STD":y3.std()}
y3_df = pd.DataFrame(y3_result)

In [443]:
y3_df

                                                 Label      Mean       STD
y31  1.ด้านความเหมาะสมของราคาอาหารเมื่อเทียบกับปริม...  4.333333  0.479463
y32        2.ราคาอาหารมีความเหมาะสมเมื่อเทียบกับคุณภาพ  4.166667  0.698932
y33                    3.มีป้ายบอกราคาที่เห็นได้ชัดเจน  4.500000  0.508548
y34                            4.เครื่องดื่มมีหลายราคา  4.166667  0.698932
y35                              5.อาหารมีหลากหลายราคา  4.500000  0.508548

In [444]:
y3_tot_mean = y3_df['Mean'].mean()
y3_tot_std = y3.stack().std()

print("Total mean is : {0:.2f}".format(y3_tot_mean))
print("Total std is : {0:.2f}".format(y3_tot_std))

Total mean is : 4.33
Total std is : 0.60

## หาค่าเฉลี่ย และส่วนเบี่ยงเบนมาตรฐานรวมของข้อมูลทั้งหมด

In [445]:
tot_mean = np.array([y1_tot_mean, y2_tot_mean, y3_tot_mean]).mean()

In [446]:
tot_std = df.stack().std()

In [447]:
conclude = pd.DataFrame({"MEAN":[tot_mean], "STD":[tot_std]})
conclude

       MEAN       STD
0  4.333333  0.650509